Assert-Promotion-service/getDistricts.yml
config:
  target: "https://staging-dashboard.cliquidator.info"
  tls: 
    rejectUnauthorized: false
  processor: '../login_processor.js'
  phases:
    - name: "load testing"
      duration: 2
      arrivalRate: 1

scenarios:
  - name: "Get Districts"
    flow:
      - function: "getToken"
      - get:
          url: "/v1/districts"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          capture:
            - json: "$[0].id"
              as: "districtId"
            - json: "$[0].label"
              as: "label"
      - log: "district Id: {{ districtId }}"
      - log: "label: {{ label }}"